---

C#Visual BasicVisual C++

Revit 2024 API
---
FamilyManager..::..ReorderParameters Method
FamilyManager Class See Also Send Feedback
---

Reorders the family parameters by the specified parameters order.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015

# Syntax

C#
---

    public void ReorderParameters(
    	IList<FamilyParameter> parameters
    )

Visual Basic
---

    Public Sub ReorderParameters ( _
    	parameters As IList(Of FamilyParameter) _
    )

Visual C++
---

    public:
    void ReorderParameters(
    	IList<FamilyParameter^>^ parameters
    )

#### Parameters

parameters
    Type: System.Collections.Generic..::..IList<(Of <(<'FamilyParameter>)>)> The new parameters order for the family. The contents of this collection should consist of exactly the same parameters returned by the GetParameters() method. This will include invisible parameters; they can be reordered but this will have no effect when viewing the parameters in the Revit UI.

# Remarks

Reordering the parameters only affects visible parameters within the same parameter group.

Parameters that belong to different groups will remain separated, and the groups' order will not be affected.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when argument is nullNothingnullptra null reference (Nothing in Visual Basic) or empty. |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the input parameters collection does not contain the same parameters as those returned by GetParameters(). |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when this family is a Rebar Shape family which doesn't support parameters reorder. |

# See Also

FamilyManager Class

Autodesk.Revit.DB Namespace